In [1]:
import pandas as pd

In [7]:
data={
    'empid':[1,2,3,4,5],
    'name':['sh','re','ya','di','xit'],
    'age':[10,11,12,12,13],
    'pic':['p1','p2','p3','p4','p5']
}
df=pd.DataFrame (data)
df=df.drop('pic',axis=1)
df

   empid name  age
0      1   sh   10
1      2   re   11
2      3   ya   12
3      4   di   12
4      5  xit   13

In [5]:
data={
    'empid':[1,2,3,4,5],
    'name':['sh','re','ya','di','xit'],
    'age':[10,11,12,12,13],
    'pic':['p1','p2','p3','p3','p5']
}
df=pd.DataFrame (data)
df
df=df[df['pic']!='p3']
df

   empid name  age pic
0      1   sh   10  p1
1      2   re   11  p2
4      5  xit   13  p5